       IDENTIFICATION DIVISION.
       PROGRAM-ID. EDITPROJ.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           COPY "FCPROJECT.COB".

       DATA DIVISION.
       FILE SECTION.
           COPY "FDPROJECT.COB".

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       PERFORM INIT-PROGRAM.

       PERFORM PROGRAM-CLEANUP.

       EXIT PROGRAM.

       INIT-PROGRAM.
           OPEN I-O PROJECT-FILE.

       PROGRAM-CLEANUP.
           CLOSE PROJECT-FILE.
